package com.example.schedule;

public class Schedule_1111 extends Schedule{
    @Override
    public void Init() {
        Init_Monday_0();
        Init_Monday_1();
        Init_Tuesday_0();
        Init_Tuesday_1();
        Init_Wednesday_0();
        Init_Wednesday_1();
        Init_Thursday_0();
        Init_Thursday_1();
        Init_Friday_0();
        Init_Friday_1();
        Init_Saturday_0();
        Init_Saturday_1();
    }

    private void Init_Monday_1() {
        Monday_1[1] = "Математический анализ доц. Киселев Е.А. 479";
        Monday_1[2] = "История доц. Лавлинский С.А. 479";
        Monday_1[3] = "Документоведение асс. Емцева А.А. 479";
    }

    private void Init_Monday_0() {
        Monday_0[1] = "Математический анализ доц. Киселев Е.А. 479";
        Monday_0[2] = "История доц. Лавлинский С.А. 479";
        Monday_0[3] = "Документоведение асс. Емцева А.А. 297";
        Monday_0[4] = "Деловое общение и культура речи доц. Козельская Н.А. 307П";
    }

    private void Init_Tuesday_1() {
        Tuesday_1[2] = "Математический анализ ст.преп. Пашкевич А.А. 477";
        Tuesday_1[4] = "Информатика доц. Зуев С.А. 384";
        Tuesday_1[5] = "Физическая культура и спорт";
    }

    private void Init_Tuesday_0() {
        Tuesday_0[2] = "Математический анализ ст.преп. Пашкевич А.А. 477";
        Tuesday_0[4] = "Информатика доц. Зуев С.А. 384";
        Tuesday_0[5] = "Физическая культура и спорт";
    }

    private void Init_Wednesday_1() {
        Wednesday_1[0] = "Психология личности и ее саморазвития ст.преп. Тенькова В.А. (ДО)";
        Wednesday_1[4] = "История доц. Лавлинский С.А. 292";
    }

    private void Init_Wednesday_0() {
        Wednesday_0[0] = "Психология личности и ее саморазвития ст.преп. Тенькова В.А. (ДО)";
        Wednesday_0[4] = "История доц. Лавлинский С.А. 292";
    }

    private void Init_Thursday_1() {
        Thursday_1[1] = "Ин.яз. доц. Барабушка И.А. 309П";
        Thursday_1[2] = "Психология личности и ее саморазвития преп. преп. Бусыгина Ю.А. 380";
        Thursday_1[4] = "СПЭД асс. Сафонов В.Г. 381";
        Thursday_1[5] = "Физическая культура и спорт";
    }

    private void Init_Thursday_0() {
        Thursday_0[0] = "Ин.яз. доц. Барабушка И.А. 309П";
        Thursday_0[1] = "Ин.яз. доц. Барабушка И.А. 309П";
        Thursday_0[2] = "Психология личности и ее саморазвития преп. преп. Бусыгина Ю.А. 380";
        Thursday_0[5] = "Физическая культура и спорт";
    }

    private void Init_Friday_1() {
        Friday_1[0] = "Введение в программирование ст.преп. Соломатин Д.И. (ДО)";
        Friday_1[1] = "Информатика доц. Сычев А.В. (ДО)";
        Friday_1[3] = "Деловое общение и культура речи доц. Козельская Н.А. (ДО)";
    }

    private void Init_Friday_0() {
        Friday_0[0] = "Введение в программирование ст.преп. Соломатин Д.И. (ДО)";
        Friday_0[1] = "Информатика доц. Сычев А.В. (ДО)";
        Friday_0[2] = "Системы подготовки электронных документов ст.преп. Копытина Е.А. (ДО)";
    }

    private void Init_Saturday_1() {
        Saturday_1[3] = "Введение в программирование асс. Нужных А.В. 293";
    }

    private void Init_Saturday_0() {
        Saturday_0[3] = "Введение в программирование асс. Нужных А.В. 293";
    }
}
